<?php

defined('ABSPATH') or exit;

function rywtp_ecpay_PaymentType_name(string $info): string
{
    static $names = [
        'WebATM_TAISHIN' => '台新銀行WebATM',
        'WebATM_ESUN' => '玉山銀行WebATM',
        'WebATM_BOT' => '台灣銀行WebATM',
        'WebATM_FUBON' => '台北富邦WebATM',
        'WebATM_CHINATRUST' => '中國信託WebATM',
        'WebATM_FIRST' => '第一銀行WebATM',
        'WebATM_CATHAY' => '國泰世華WebATM',
        'WebATM_MEGA' => '兆豐銀行WebATM',
        'WebATM_LAND' => '土地銀行WebATM',
        'WebATM_TACHONG' => '大眾銀行WebATM',
        'WebATM_SINOPAC' => '永豐銀行WebATM',
        'ATM_TAISHIN' => '台新銀行ATM',
        'ATM_ESUN' => '玉山銀行ATM',
        'ATM_BOT' => '台灣銀行ATM',
        'ATM_FUBON' => '台北富邦ATM',
        'ATM_CHINATRUST' => '中國信託ATM',
        'ATM_FIRST' => '第一銀行ATM',
        'ATM_LAND' => '土地銀行ATM',
        'ATM_CATHAY' => '國泰世華銀行ATM',
        'ATM_TACHONG' => '大眾銀行ATM',
        'ATM_PANHSIN' => '板信銀行ATM',
        'ATM_KGI' => '凱基銀行ATM',
        'CVS_CVS' => '超商代碼繳款',
        'CVS_OK' => 'OK超商代碼繳款',
        'CVS_FAMILY' => '全家超商代碼繳款',
        'CVS_HILIFE' => '萊爾富超商代碼繳款',
        'CVS_IBON' => '7-11 ibon代碼繳款',
        'BARCODE_BARCODE' => '超商條碼繳款',
        'Credit_CreditCard' => '信用卡',
        'Flexible_Installment' => '永豐30期',
        'TWQR_OPAY' => '歐付寶TWQR 行動支付',
        'BNPL_URICH' => '裕富數位無卡分期',
        'WeiXin_OPAY' => '微信支付',
        'BNPL_ZINGALA' => '中租銀角零卡',
        'DigitalPayment_Jkopay' => '街口支付',
        'DigitalPayment_IPASS' => '一卡通 iPASS MONEY',
    ];

    return $names[$info] ?? $info;
}

function rywtp_ecpay_PayFrom_name(string $info): string
{
    static $names = [
        'family' => '全家',
        'hilife' => '萊爾富',
        'okmart' => 'OK超商',
        'ibon' => '7-11',
    ];

    return $names[$info] ?? $info;
}

function rywtp_ecpay_RtnValueStatus_name(string $info): string
{
    static $names = [];
    if (empty($names)) {
        $names = [
            'Canceled' => '此筆交易已取消',
            'Unauthorized' => '銀行未授權完成',
            'Authorized' => '銀行已完成授權',
            'To be captured' => '要關帳',
            'Captured' => '已關帳',
            'Operation canceled' => '操作取消',
        ];
    }

    return $names[$info] ?? $info;
}

function rywtp_ecpay_CloseDataStatus_name(string $info): string
{
    static $names = [];
    if (empty($names)) {
        $names = [
            'To be captured' => '要關帳',
            'Captured' => '已關帳',
            'Canceled' => '已取消',
            'Operation canceled' => '操作取消',
        ];
    }

    return $names[$info] ?? $info;
}

function rywtp_ecpay_LogisticsType_name(string $info): string
{
    static $names = [];
    if (empty($names)) {
        $names = [
            'FAMI' => '全家物流(B2C)',
            'UNIMART' => '7-ELEVEN超商物流(B2C)',
            'UNIMARTFREEZE' => '7-ELEVEN冷凍店取(B2C)',
            'FAMIC2C' => '全家物流(C2C)',
            'UNIMARTC2C' => '7-ELEVEN超商物流(C2C)',
            'HILIFE' => '萊爾富物流(B2C)',
            'HILIFEC2C' => '萊爾富物流(C2C)',
            'OKMARTC2C' => 'OK超商(C2C)',
            'TCAT' => '黑貓物流',
            'POST' => '中華郵政',
        ];
    }

    return $names[$info] ?? $info;
}

function rywtp_ecpay_LogisticsStatus_name(string $info): string
{
    static $names = [
        '300' => '訂單處理中(綠界已收到訂單資料)',
        '310' => '訂單上傳物流中',
        '311' => '訂單傳送物流成功',
        '320' => '郵局已確認資料，可列印',
        '325' => '退貨訂單處理中(綠界已收到訂單資料)',
        '2000' => '已申請門市變更',
        '2001' => '訂單傳送超商成功',
        '2002' => '出貨單號不合規則',
        '2003' => 'XML檔內出貨單號重複',
        '2004' => '出貨單號重複上傳使用(驗收時發現)',
        '2005' => '日期格式不符',
        '2006' => '訂單金額或代收金額錯誤',
        '2007' => '商品類型為空',
        '2008' => '訂單為空',
        '2009' => '門市店號為空',
        '2010' => '出貨日期為空',
        '2011' => '出貨金額為空',
        '2012' => '出貨編號不存在',
        '2013' => '母廠商不存在',
        '2014' => '子廠商不存在',
        '2015' => '出貨編號已存在(單筆)',
        '2016' => '門市已關轉店，將進行退貨處理',
        '2017' => '出貨日期不符合規定',
        '2018' => '服務類型不符規定(如只開取貨付款服務，卻使用純取貨服務)',
        '2019' => '商品類型不符規定',
        '2020' => '廠商尚未申請店配服務',
        '2021' => '同一批次出貨編號重複(批次)',
        '2022' => '出貨金額不符規定',
        '2023' => '取貨人姓名為空',
        '2024' => '訂單傳送超商成功',
        '2025' => '門市轉店號(舊門市店號已更新)',
        '2026' => '無此門市，將進行退貨處理',
        '2027' => '門市指定時間不配送，後續配送中',
        '2028' => '門市關轉店，3日內未更新SUP(新店號)便至退貨流程',
        '2029' => '門市尚未開店',
        '2030' => '物流中心驗收成功',
        '2031' => '等待賣家出貨',
        '2032' => '包裝異常，請洽客服',
        '2033' => '包裹超材，退回賣家',
        '2034' => '違禁品(退貨及罰款處理)',
        '2035' => '訂單資料重複上傳',
        '2036' => '訂單超過驗收期限（賣家未出貨）',
        '2037' => '取件門市關轉，請重選門市',
        '2038' => '標籤錯誤，廠退處理',
        '2039' => '標籤錯誤，廠退處理',
        '2040' => '標籤錯誤，廠退處理',
        '2041' => '物流中心理貨中',
        '2042' => '包裹遺失，進入賠償程序',
        '2043' => '門市指定時間不配送，後續配送中',
        '2044' => '賣家已取退回包裹',
        '2045' => '不正常到貨(商品提早到物流中心)，廠退處理',
        '2046' => '貨件未取退回大智通物流中心',
        '2047' => '正常二退(退貨時間延長，在判賠期限內退回)',
        '2048' => '包裝異常，請洽客服',
        '2049' => '門市關店，將進行退貨處理',
        '2050' => '門市轉店，將進行退貨處理',
        '2051' => '賣家要求提早退貨',
        '2052' => '違禁品(退貨及罰款處理)',
        '2053' => '門市誤刷取件，包裹退回中',
        '2054' => '賣家要求提早退貨',
        '2055' => '包裹退至物流中心',
        '2057' => '車輛故障，後續配送中',
        '2058' => '天候不佳，後續配送中',
        '2059' => '道路中斷，後續配送中',
        '2060' => '門市停業，廠退處理',
        '2061' => '包裹異常，請洽客服',
        '2062' => '包裹門市確認中',
        '2063' => '包裹配達取件門市',
        '2065' => '買家未取包裹，將退回物流中心',
        '2066' => '包裹確認中，將退回物流中心',
        '2067' => '買家已到店取貨',
        '2068' => '賣家已到門市寄件',
        '2069' => '退貨便收件(商品退回指定C門市)',
        '2070' => '賣家已取退回包裹',
        '2071' => '門市代碼格式錯誤',
        '2072' => '包裹已退至原寄件門市',
        '2073' => '包裹配達取件門市',
        '2074' => '買家未取包裹，將退回物流中心',
        '2075' => '賣家未取包裹，將退回物流中心',
        '2076' => '買家未取包裹，已退回物流中心',
        '2077' => '賣家未取包裹，待申請退回',
        '2078' => '買家未取包裹，已退回物流中心',
        '2079' => '買家未取貨退回物流中心-商品瑕疵(進物流中心)',
        '2080' => '買家未取貨退回物流中心-超材',
        '2081' => '買家未取貨退回物流中心-違禁品(退貨及罰款處理)',
        '2082' => '買家未取貨退回物流中心-訂單資料重複上傳',
        '2083' => '買家未取貨退回物流中心-已過門市進貨日（未於指定時間內寄至物流中心)',
        '2084' => '買家未取貨退回物流中心-第一段標籤規格錯誤',
        '2085' => '買家未取貨退回物流中心-第一段標籤無法判讀',
        '2086' => '買家未取貨退回物流中心-第一段標籤資料錯誤',
        '2087' => '買家未取貨退回物流中心-物流中心理貨中',
        '2088' => '買家未取貨退回物流中心-商品遺失',
        '2089' => '買家未取退回物流中心-門市指定不配送(六、日)',
        '2092' => '買家未取退回物流中心-門市關轉',
        '2093' => '買家未取退回物流中心-爆量',
        '2094' => '包裹異常，請洽客服',
        '2095' => '天候路況不佳',
        '2096' => '賣家未取包裹，待申請退回',
        '2097' => '包裹宅配退回中',
        '2098' => '包裹重新配達取件門市',
        '2099' => '包裹重新配達寄件門市',
        '2101' => '門市關轉店',
        '2102' => '門市舊店號更新',
        '2103' => '無取件門市資料',
        '2104' => '門市關轉，請重選門市',
        '2105' => '已申請門市變更',
        '3001' => '轉運中(即集貨)',
        '3002' => '不在家',
        '3003' => '配完',
        '3004' => '送錯BASE (送錯營業所)',
        '3005' => '送錯CENTER(送錯轉運中心)',
        '3006' => '配送中',
        '3007' => '公司行號休息',
        '3008' => '地址錯誤，聯繫收件人',
        '3009' => '搬家',
        '3010' => '轉寄(如原本寄到A，改寄B)',
        '3011' => '暫置營業所(收件人要求至營業所取貨)',
        '3012' => '到所(收件人要求到站所取件)',
        '3013' => '當配下車(當日配送A至B營業所，已抵達B營業所)',
        '3014' => '當配上車(當日配送從A至B營業所，已抵達A營業所)',
        '3015' => '空運配送中',
        '3016' => '配完狀態刪除',
        '3017' => '退回狀態刪除(代收退貨刪除)',
        '3018' => '包裹配達取件門市',
        '3019' => '包裹已退至原寄件門市',
        '3020' => '買家未取包裹，將退回物流中心',
        '3021' => '賣家未取包裹，待申請退回',
        '3022' => '買家已到店取貨',
        '3023' => '賣家已取退回包裹',
        '3024' => '物流中心驗收成功',
        '3025' => '買家未取包裹，已退回物流中心',
        '3029' => '包裹已配達指定取件門市',
        '3031' => '包裹已退至指定寄件門市',
        '3032' => '賣家已到門市寄件',
        '3033' => 'EC客戶要求提早退貨',
        '3117' => '拒收(調查處理中)',
        '3118' => '暫置營業所',
        '3119' => '暫置營業所(假日暫置)',
        '3120' => '預備配送中',
        '3121' => '轉交門市配達',
        '3122' => '另約時間',
        '3123' => '逾期未取，門市刷退',
        '3124' => '退貨包裹待司機取回',
        '3125' => '司機已到門市取回',
        '3301' => '交寄郵件',
        '3302' => '各區郵局招領中',
        '3303' => '投遞不成功',
        '3304' => '依寄件人指示銷毀',
        '3305' => '拒收',
        '3306' => '退回投遞不成功',
        '3307' => 'i郵箱取件成功',
        '3308' => '投遞成功',
        '3309' => '投遞成功(收受人領取)',
        '3310' => '已退回寄件人',
        '3311' => '退回郵件投遞中',
        '3312' => '貨件投遞中',
        '3313' => '郵局貨件運轉中',
        '3314' => '到達i郵箱',
        '3315' => 'i郵箱逾期退招領',
        '4001' => '買家已到門市寄件',
        '4002' => '退貨商品已至物流中心',
        '4003' => '退件包裹異常，協尋中',
        '4004' => '包裹遺失，進入賠償程序',
        '5001' => '損壞，站所將協助退貨',
        '5002' => '遺失',
        '5003' => 'BASE列管(寄件人和收件人聯絡不到)',
        '5004' => '賣家未取包裹，待申請退回',
        '5005' => '代收退貨',
        '5006' => '代收毀損',
        '5007' => '代收遺失',
        '5008' => '退貨配完',
        '5009' => '包裹異常，請洽客服',
        '7001' => '超大(通常發生於司機取件，不取件)',
        '7002' => '超重(通常發生於司機取件，不取件)',
        '7003' => '地址錯誤，聯繫收件人',
        '7004' => '航班延誤',
        '7005' => '託運單刪除',
        '7006' => '包裹遺失，進入賠償程序',
        '7007' => '包裹遺失，進入賠償程序',
        '7008' => '包裹破損，請洽客服',
        '7009' => '包裝異常，請洽客服',
        '7010' => '包裝異常，請洽客服',
        '7011' => '取件門市關轉，請重選門市',
        '7012' => '條碼錯誤，廠退處理',
        '7013' => '訂單超過驗收期限（賣家未出貨）',
        '7014' => '等待賣家出貨',
        '7015' => '條碼重複，請洽客服',
        '7016' => '包裹超材，退回賣家',
        '7017' => '取件包裹異常，協尋中',
        '7018' => '包裹遺失，進入賠償程序',
        '7019' => '寄件包裹異常，協尋中',
        '7020' => '包裹遺失，進入賠償程序',
        '7021' => '包裹異常，請洽客服',
        '7022' => '包裹異常，請洽客服',
        '7023' => '包裹異常，請洽客服',
        '7024' => '另約時間',
        '7025' => '電聯不上',
        '7026' => '資料有誤',
        '7027' => '無件可退',
        '7028' => '超大超重',
        '7029' => '已回收',
        '7030' => '別家收走',
        '7031' => '商品未到',
        '7032' => '寄件門市關轉，請重選門市',
        '7033' => '資料異常',
        '7034' => '貨物進店發生異常，請洽客服',
        '7035' => '逾期未領，貨件銷毀',
        '7036' => '貨件破損，請洽客服',
        '7037' => '訂單上傳失敗',
        '7038' => '門市驗收異常，請洽客服',
        '7101' => '取件門市關轉，請重選門市',
        '7102' => '包裹配送驗收異常-無進貨資料',
        '7103' => '包裹配送驗收異常-條碼錯誤',
        '7104' => '包裹配送驗收異常-超材',
        '7105' => '包裹配送驗收異常-大物流包裝不良(滲漏)',
        '7106' => '包裹配送驗收異常-小物流破損',
        '7107' => '包裹配送驗收異常-門市反應商品包裝不良(滲漏)',
        '7201' => '寄件門市關轉，請重選門市',
        '7202' => '退貨包裹配送驗收異常-無進貨資料',
        '7203' => '退貨包裹配送驗收異常-條碼錯誤',
        '7204' => '退貨包裹配送驗收異常-超材',
        '7205' => '退貨包裹配送驗收異常-大物流包裝不良(滲漏)',
        '7206' => '退貨包裹配送驗收異常-小物流破損',
        '7207' => '退貨包裹配送驗收異常-門市反應商品包裝不良(滲漏)',
        '7255' => '包裹退至物流中心',
        '7300' => '郵局接收資料異常',
        '7301' => '郵件破損 - 無法投遞',
        '7302' => '郵件遺失',
        '9001' => '退貨已取',
        '9999' => '訂單取消',
    ];

    return $names[$info] ?? $info;
}

function rywtp_newebpay_PaymentType_name(string $info): string
{
    static $names = [
        'CREDIT' => '信用卡付款',
        'VACC' => '銀行ATM 轉帳付款',
        'WEBATM' => '網路銀行轉帳付款',
        'BARCODE' => '超商條碼繳費',
        'CVS' => '超商代碼繳費',
        'LINEPAY' => 'LINE Pay 付款',
        'ESUNWALLET' => '玉山Wallet',
        'TAIWANPAY' => '台灣Pay',
        'CVSCOM ' => ' 超商取貨付款',
        'AFTEE' => 'AFTEE 先享後付',
        'FULA' => 'Fula 付啦',
    ];

    return $names[$info] ?? $info;
}

function rywtp_newebpay_PaymentMethod_name(string $info): string
{
    static $names = [
        'CREDIT' => '台灣發卡機構核發之信用卡',
        'FOREIGN' => '國外發卡機構核發之卡',
        'NTCB' => '國民旅遊卡',
        'UNIONPAY' => '銀聯卡',
        'APPLEPAY' => 'ApplePay',
        'GOOGLEPAY' => 'GooglePay',
        'SAMSUNGPAY' => 'SamsungPay',
    ];

    return $names[$info] ?? $info;
}
